app/controllers/users_controller.rb

  def create
    ref_code = cookies[:h_ref]
    email = params[:user][:email]
    @user = User.find_by_email(email) || User.new(email: email)
    @user.referrer = User.find_by_referral_code(ref_code) if ref_code

    if @user.save
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "jbuhlig@gmail.com"]]
SELECT  "users".* FROM "users" WHERE "users"."referral_code" = $1 LIMIT 1  [["referral_code", "a42177470a"]]
INSERT INTO "users" ("email", "created_at", "updated_at", "referral_code") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "jbuhlig@gmail.com"], ["created_at", "2016-05-25 16:59:32.491342"], ["updated_at", "2016-05-25 16:59:32.491342"], ["referral_code", "a42177470a"]]

  def refer
    @bodyId = 'refer'
    @is_mobile = mobile_device?

    @user = User.find_by_email(cookies[:h_email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT 1  [["email", "jbuhlig@gmail.com"]]